questions = [
    {
        "question": "대한민국 헌법의 가치와 의의를 존중하는가?",
    },
	{
        "question": "4.19, 5.18, 6월 항쟁을 민주화 운동을 인정하는가?",
    },
    {
        "question": "4.3 사건과 보도연맹사건에 공권력에 의한 무고한 민간인 학살이 있었으며 두 사건은 과거 정부가 고의적을 은폐했음을 인정하는가?",
    },
    {
        "question": "박근혜는 헌정질서를 위반하여 합법적인 절차에 따라 탄핵된 범죄자라는 것을 인정하는가?",
    },
    {
        "question": "21대 총선과 4.7 재보선의 결과가 조작된 것이 아님을 인정하는가?",
    },
    {
        "question": "천안함과 세월호 피해자에 대한 음모론과 모독적 발언을 부정하는가?",
    },
    {
        "question": "북한의 독재와 주체사상을 비판하고 비난할 수 있는가?",
    },
    {
        "question": "특정 지역, 특정 성향, 특정 성별, 특정 성정체성, 특정 성적지향, 신체적인 특정 능력과 특징에 대한 혐오 표현을 일절 쓰지 않을 것을 약속하는가?",
    },
    {
        "question": "전 인류의 천부적이고 보편적인 인권을 존중하는가?",
    },
    {
        "question": "제국주의와 전체주의를 반대하며, 그로 인한 차별과 반인류적 행위가 정당하지 않음을 인정하는가?",
    },
    {
        "question": "사회주의 계통 독립운동가의 업적을 인정하는가?",
    },
    {
        "question": "민주주의의 기본질서를 인정하고, 사회주의가 사회 진보에 결정적인 역할을 했음을 인정하는가?",
    },
    {
        "question": "국가(정부)는 필요하다고 법에서 정한 선에서 경제에 개입하는 것이 사회에 이익이며, 국가(정부)가 경제에 개입하지 않으면 독점, 과점, 담합 등이 일어날 수 있음을 인정하는가?",
    },
    {
        "question": "2021년 한국 사회 기준 남성중심사회적 요소가 남아있고 여성이 차별을 어느정도 받고 있음을 인정하는가?",
    },
    {
        "question": "한국 재벌의 성장에는 창업주의 노력보다 군부독재세력의 조직적인 지원이 더 결정적이었음을 인정하는가?",
    },
    {
        "question": "사회주의적인 요소가 존재하거나 사회주의적인 특징이 혼재하는 경제체제도 자본주의 시스템으로 인정하는가?",
    },
    {
        "question": "박정희 정부 당시 극단적인 노동착취(산업재해 세계 최고 수준 달성, 세계 최악의 노동환경 지정)가 있었으며, 도시 빈민화가 급속도로 진행되었음을 인정하는가?",
    },
    {
        "question": "박정희 정부와 전두환 정부의 공이 과장되어 있음을 인정하는가?",
    },
    {
        "question": "사회 질서와 경제적인 불평등이 불가피한 것은 아니라는 것을 인정하는가?",
    },
    {
        "question": "부유층이 상대적으로 많은 세금을 내야 하는 것이 보편타당함을 인정하는가?",
    },
    {
        "question": "일제시대는 한국의 발전에 있어서 공보다 과가 많았음을 인정하는가?",
    },
    {
        "question": "모든 사람은 종교의 자유를 가진다는 것을 인정하고, 종교 다를 수 있음을 인정하는가?",
    },
    {
        "question": "취약 청소년, 소외여성에 대한 지원을 담당하고 있는 여성가족부의 존재가 필요함을 인정하는가?",
    },
    {
        "question": "상속이 합법적인 부(富)임을 인정하는가?",
    },
    {
        "question": "동성애는 죄악이나 질병이 아니며, 성소수자가 현재 차별받고 있음을 인정하는가?",
    },
    {
        "question": "극좌와 극우, 내셔널리즘, 중국특색사회주의, 스탈린주의가 극단주의이며 지역 사회 발전에 악영향을 줌을 인정하는가?",
    },
    {
        "question": "2009년 쌍용자동차 노조 파업 사태가 불법적인 시위임을 인정하면서, 이를 정부 과도하게 진압하고 노조원의 존엄성을 짓밟았다는 것을 인정하는가?",
    },
    {
        "question": "2020년~2021년 민주노총의 집회가 정부의 방역 통제와 사회적 거리두기에 따르지 않았다는 것을 인정하는가?",
    },
    {
        "question": "노조의 활성화가 건전한 경제문화 중 하나라는 것을 인정하고, 공무원노조와 전교조의 법외노조화가 부당함을 인정하는가?",
    },
    {
        "question": "모든 자유는 제한없이 행사될 수 있으며 누군가가 제한할 수는 없다는 자유지상주의적 자유에는 문제가 많음을 인정하고, 자유는 남의 자유를 침해하지 않는 선에서만 유효하다는 사실을 인정하는가?",
    }
];
